"5.1 Sequence Type (Tuple)"
# Кортеж - незмінна послідовність, що використовується для зберігання різноманітних об'єктів.

# Створення кортежа:
# 1.
a = (1, 2, 3, 4, 5)
print(a, type(a))

# 2.
b = 6, 7, 8, 9, 10
print(a, type(a))

# 3.
c = tuple(), tuple((1, 2)), tuple([3, 4]), tuple(range(5))
print(c, type(c))

# Операції з кортежами:
# 1. len() - функція, що визначає довжину послідовності
print(len(a))

# 2. x in a, x not in a - чи знаходиться елемент х в послідовності а
print(2 in a)
print(3 not in a)

# 3. a + b - конкатенація кортежу
print(a + b)

# 4. a * 2 - дублювання кортежу
print(a * 2)

# 5. min() - мінімальний елемент кортежу
print(min(a))

# 6. max() - максимальний елемент кортежу
print(max(a))

# 7. sum() - функція суми
print(sum(a))

# 8. a[3] - 1-й елемент в кортежі
print(a[0])

# 9. .index() - знаходить індекс елемента
print(a.index("3", 0, 5))

# 10. .count() - кількість елементів в послідовності
print(a.count("3", 1, 4))
